Revit 2026 API

# PanelScheduleViewGetCellsBySlotNumber Method

---
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void GetCellsBySlotNumber(
	int nSlotNumber,
	out IList<int> RowArr,
	out IList<int> ColArr
)
```
```vb
Public Sub GetCellsBySlotNumber (
	nSlotNumber As Integer,
	<OutAttribute> ByRef RowArr As IList(Of Integer),
	<OutAttribute> ByRef ColArr As IList(Of Integer)
)
```
```cpp
public:
void GetCellsBySlotNumber(
	int nSlotNumber,
	[OutAttribute] IList<int>^% RowArr,
	[OutAttribute] IList<int>^% ColArr
)
```
```fsharp
member GetCellsBySlotNumber :
        nSlotNumber : int *
        RowArr : IList<int> byref *
        ColArr : IList<int> byref -> unit
```

#### Parameters

nSlotNumber Int32

RowArr IListInt32

ColArr IListInt32

#### Reference

PanelScheduleView Class

Autodesk.Revit.DB.Electrical Namespace